{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Упражнение 1. От А до B\n",
    "\n",
    "Даны два целых числа A и В (каждое в отдельной строке). Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Упражнение 2. Проверка на простоту\n",
    "Дано натуральное число $n>1$. Проверьте, является ли оно простым. Программа должна вывести слово YES, если число простое и NO, если число составное. Алгоритм должен иметь сложность $O(n^\\frac{1}{2})$.\n",
    "\n",
    "Указание. Понятно, что задача сама по себе нерекурсивна, т.к. проверка числа $n$ на простоту никак не сводится к проверке на простоту меньших чисел. Поэтому нужно сделать еще один параметр рекурсии: делитель числа, и именно по этому параметру и делать рекурсию."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Упражнение 3. Количество единиц \n",
    "Дана последовательность натуральных чисел (одно число в строке), завершающаяся двумя числами 0 подряд. Определите, сколько раз в этой последовательности встречается число 1. Числа, идущие после двух нулей, необходимо игнорировать.\n",
    "\n",
    "В этой задаче нельзя использовать глобальные переменные и параметры, передаваемые в функцию. Функция получает данные, считывая их с клавиатуры, а не получая их в виде параметров."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Упражнение 4. Треугольная последовательность\n",
    "\n",
    "Дана монотонная последовательность, в которой каждое натуральное число $k$ встречается ровно $k$ раз:\n",
    "```\n",
    "1, 2, 2, 3, 3, 3, 4, 4, 4, 4,…\n",
    "```\n",
    "По данному натуральному $n$ выведите первые $n$ членов этой последовательности. Попробуйте обойтись только одним циклом for."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Упражнение 5. Сиракузская последовательность\n",
    "Распечатайте [сиракузскую последовательность](https://ru.wikipedia.org/wiki/%D0%93%D0%B8%D0%BF%D0%BE%D1%82%D0%B5%D0%B7%D0%B0_%D0%9A%D0%BE%D0%BB%D0%BB%D0%B0%D1%82%D1%86%D0%B0) для произвольного начального $n$, используя рекурсию."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Упражнение 6. Быстрое возведение в степень\n",
    "\n",
    "1. Реализуйте функцию `pow_c()`, вычисляющую натуральные степени $a^N$, $N \\in \\mathbb{N}$. Вычисление должно производиться простейшим способом в цикле без использования рекурсии.\n",
    "\n",
    "2. Реализуйте функцию `pow_r()`, для вычисления натуральных степеней с помощью рекурсии.\n",
    "\n",
    "3. Реализуйте функцию `pow_fast_c()`, вычисляющую натуральные степени числа $a$. Вычисление должно производиться без использования рекурсии. **Оптимизируйте алгоритм с помощью перевода $N$ в двоичную систему счисления.** Пусть требуется вычислить $a^N$, а натуральное число $N$ в двоичной системе счисления имеет вид  $\\alpha_k \\alpha_{k-1} ... \\alpha_0$, где $\\left\\lbrace \\alpha_i \\right\\rbrace^k_{i=0}$ - цифры в двоичной системе счисления. Получаем \n",
    "$$\\large {a^N = a^{\\sum_{i=0}^k \\alpha_i 2^i} = \\displaystyle\\prod_{i=0}^k \\left(a^\\left(2^i\\right)\\right)^{\\alpha_i}}.$$\n",
    "Рассмотрим более пристально выражение $a^\\left(2^i\\right)$. Легко видеть, что\n",
    "$$\\large{a^\\left(2^{i-1}\\right) \\cdot a^\\left(2^{i-1}\\right) = a^{2^{i-1} + 2^{i-1}} = a^{2 \\cdot 2^{i-1}} = a^\\left(2^i\\right)}$$\n",
    "Таким образом, при вычислении  натуральной степени числа $a$ должен производится перевод показателя степени $N$ из десятичной системы счисления в двоичную. Если результат (число $a^N$) собирается в переменной $pow$, то  на итерации цикла вместо добавления разряда в двоичную запись $N$ в $pow$ умножается на $a^{\\alpha_i 2^i}$. Кроме того, на каждой итерации с помощью формулы\n",
    "$$\\large{a^\\left(2^i\\right) = a^\\left(2^{i-1}\\right) \\cdot a^\\left(2^{i-1}\\right)}$$\n",
    "пересчитывается $a^\\left(2^i\\right)$.\n",
    "\n",
    "4. Реализуйте рекурсивную функцию `pow_fast_r()` для вычисления $a^N$, использующую оптимизацию из пункта 3.\n",
    "\n",
    "- Определите скорость работы алгоритмов. Пример того, как это можно сделать, есть в следующей клетке.\n",
    "\n",
    "- Как Вы считаете, возможно ли повысить эффективность алгоритма из пункта 3, если переводить $N$ в систему счисления с большим основанием? Ответ обоснуйте."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "import math\n",
    "import time\n",
    "start = time.clock()\n",
    "N = 1000\n",
    "for _ in range(N):\n",
    "    math.factorial(N)\n",
    "print(\"Среднее время вычисления факториала:\", (time.clock() - start) / N)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Упражнение 7. Проверка правильности скобочной последовательности\n",
    "\n",
    "На вход подается строка, состоящая из символов `'('`, `')'`, `'['`, `']'`, `'{'`, `'}'`. Проверьте, является скобочная последовательность правильной, т. е. все ли скобки корректно закрыты.\n",
    "\n",
    "| <font size=3>Входные данные</font> | <font size=3>Выходные данные</font>    |\n",
    "| :--- | :--- |\n",
    "| <font size=3>((</font> | <font size=3>False</font> |\n",
    "| <font size=3>()</font> | <font size=3>True</font> |\n",
    "| <font size=3>([)]</font> | <font size=3>False</font> |\n",
    "| <font size=3>(){[]}</font> | <font size=3>True</font> |"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
