{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# <font color=blue>Однопроходные алгоритмы</font>\n",
    "\n",
    "Правило простое: **если последовательность можно не хранить – ее хранить не нужно!** Из этого правила следует эффективность по времени. Раз мы не храним последовательность, то не можем просматривать ее много раз. Все делается за один \"проход\". А это быстро. Рассмотрим такие алгоритмы обработки последовательности, которые позволяют ее не хранить.\n",
    "\n",
    "### Пример 1. Поиск максимума\n",
    "\n",
    "Требуется распечатать наибольшее из поступивших на вход чисел. Сначала подается количество чисел в последовательности $N > 0$, а затем $N$ чисел (каждое в отдельной строке).\n",
    "\n",
    "| <font size=3>Входные данные</font> | <font size=3>Выходные данные</font>    |\n",
    "| :--- | :--- |\n",
    "| <font size=3>4<br>1<br>2<br>-1.5<br>0</font> | <font size=3>2</font> |"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "N = int(input())\n",
    "m = float(input())\n",
    "for _ in range(N - 1):\n",
    "    x = float(input())\n",
    "    if x > m:\n",
    "        m = x\n",
    "print(x)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Упражнение 1. Поиск второго максимума\n",
    "Напишите программу, опредеделяющую второе по величине число в последовательности. Сначала подается количество чисел в последовательности $N > 1$, а затем $N$ чисел (каждое в отдельной строке). \n",
    "\n",
    "| <font size=3>Входные данные</font> | <font size=3>Выходные данные</font>    |\n",
    "| :--- | :--- |\n",
    "| <font size=3>4<br>1<br>2<br>-1.5<br>0</font> | <font size=3>1</font> |"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Упражнение 2. Пропущенное число\n",
    "\n",
    "В последовательности записаны целые числа от 1 до N в произвольном порядке, но одно из чисел пропущено (остальные встречаются ровно по одному разу). N заранее неизвестно. Определить пропущенное число. Числа подаются по очереди, каждое в отдельной строке."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Упражнение 3. Исключение повторяющихся чисел\n",
    "\n",
    "В последовательности записаны целые числа. Одно из чисел встречается ровно один раз, остальные — по два раза. Найти число, которое встречается один раз. Сначала на вход подается $N$, затем по очереди $N$ чисел: каждое в отдельной строке."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Упражнение 4. Найти повторяющееся число\n",
    "В последовательности записаны целые числа, больше половины из которых равны одному и тому же числу X. За один просмотр последовательности найти это число. Сначала на вход подается $N$, затем по очереди $N$ чисел: каждое в отдельной строке."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Упражнение 5. Среднеквадратичное отклонение\n",
    "Вычислите среднеквадратичное отклонение $\\sigma$ случайной величины $\\xi$ на основании несмещенной оценки дисперсии. Сначала на вход подается $N$, затем по очереди $N$ элементов выборки: каждый в отдельной строке.\n",
    "\n",
    "#### Идея решения.\n",
    "\n",
    "Запишем формулу для вычисления среднеквадратичного отклонения.\n",
    "$$\\sigma = \\sqrt{D}$$\n",
    "В приведенной выше формуле $D$ - оценка дисперсии, которая вычисляется по формуле\n",
    "$$D = \\frac{1}{N-1} \\displaystyle\\sum^N_{i=1} \\left(X_i - \\overline{X}\\right)^2,$$\n",
    "где $X_i$ - элементы выборки, $N$ - число элементов в выборке, $\\overline{X}$ - среднее арифметическое элементов выборки.\n",
    "\n",
    "Рассмотрим сумму $\\displaystyle\\sum^N_{i=1} \\left(X_i - \\overline{X}\\right)^2$. Принимая во внимание, что $\\overline{X} = \\frac{1}{N} \\displaystyle\\sum^N_{i=1} X_i$, получаем\n",
    "$$\\sum^N_{i=1} \\left(X_i - \\overline{X}\\right)^2 = \\sum^N_{i=1} \\left(X_i^2 - 2 X_i \\overline{X} + \\overline{X}^2\\right) = \\sum^N_{i=1} X_i^2 - \\sum^N_{i=1} 2 X_i \\overline{X} + \\sum^N_{i=1} \\overline{X}^2 = \\sum^N_{i=1} X_i^2 - 2 \\overline{X} \\sum^N_{i=1} X_i + N \\overline{X}^2 = \\sum^N_{i=1} X_i^2 - 2 N \\overline{X} \\overline{X} + N \\overline{X}^2 = \\sum^N_{i=1} X_i^2 - N \\overline{X}^2.$$ \n",
    "\n",
    "В результате оказывается, что для вычисления дисперсии и среднеквадратичного отклонения достаточно посчитать сумму элементов выборки $S_1 = \\displaystyle\\sum^N_{i=1} X_i$ и сумму квадратов элементов выборки $S_2 = \\displaystyle\\sum^N_{i=1} X_i^2$.\n",
    "\n",
    "$$D = \\frac{1}{N-1} \\left(S_2 - \\frac{S_1^2}{N}\\right)$$"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Упражнение 6. Максимальная нечетная сумма\n",
    "Имеется набор данных, состоящих из пар положительных целых чисел. Необходимо выбрать из каждой пары ровно одно число так, чтобы сумма квадратов всех выбранных чисел была нечетной и при этом максимально возможной. Если получить требуемую сумму невозможно, в качестве ответа нужно выдать 0.\n",
    "\n",
    "Напишите программу для решения этой задачи.\n",
    "Постарайтесь сделать программу эффективной по времени, если время работы программы пропорционально количеству пар чисел $N$, т.е. при увеличении $N$ в $k$ раз время работы программы должно увеличиваться на более чем в $k$ раз.\n",
    "\n",
    "На вход подается число $N$, а затем $N$ пар чисел: каждая в отдельной строке.\n",
    "\n",
    "[Тут](http://labs.org.ru/ege-27/) есть разбор."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Упражнение 7. Очередь\n",
    "В длинной очереди стоят люди. Для каждого из них, кроме последнего, записали его имя и имя того, кто стоит за ним. Полученные записи перемешали и записали в файл. Требуется за один просмотр файла определить имена первого и последнего человека. Известно, что эти имена различны (иначе задача неразрешима), но, в общем, имена могут повторяться. Имя каждого человека состоит из шестнадцати 8-битных символов.\n",
    "\n",
    "На вход подается число $N$, а затем $N$ пар имен: каждая пара в отдельной строке.\n",
    "\n",
    "[Тут](https://habr.com/post/243819/) есть разбор."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
